# Подключаем встроенные модули и библиотеки:
import json
import random
from loader import bot
from telebot import types

# Подключаем свои модули:
import button
import printer

# Нужные функции:
def players(num_players: int) -> list:
    """Создаёт список игроков на основе ввода имён или их количества.

    Args:
        num_players: Количество игроков.

    Returns:
        Возвращает список игроков.
    """
    lst_players = []
    for val in range(num_players):
        lst_players.append(f'Игрок {val + 1}')
    return lst_players


def sec_word(user_theme: str, themes: dict, chat_id: str) -> str:
    """Выбирает случайное секретное слово, которое должны угадать Шпионы.

    Args:
        user_theme: Тема, выбранная пользователем.
        themes: Словарь тем со словами.
        chat_id: ID чата пользователя.

    Returns:
          Возвращает секретное слово.
    """
    if user_theme in themes["Main_themes"]:
        lst_words = themes["Main_themes"][user_theme]
    else:
        lst_words = themes[chat_id][user_theme]
    choice_word = random.choice(lst_words)
    return choice_word


def create_shpion(num_shpions: int, lst_players: list) -> list:
    """Создаёт список шпионов для игры.

    Args:
        num_shpions: Кол-во Шпионов.
        lst_players: Список игроков.

    Returns:
        Возвращает список Шпионов.
    """
    shpion1 = random.choice(lst_players)
    shpions = [shpion1]
    if num_shpions == 2:
        lst_without_shpion1 = [i for i in lst_players if i != shpion1]
        shpion2 = random.choice(lst_without_shpion1)
        shpions.append(shpion2)
    return shpions


def create_theme(themes: dict, theme_name: str, words: tuple, chat_id: str):
    """Создаёт тему со словами от пользователя.

    Args:
        themes: Словарь тем со словами.
        theme_name: Тема, введённая от пользователя.
        words: Слова, введённая от пользователя
        chat_id: ID чата пользователя.
    """
    if chat_id not in themes:
        themes[chat_id] = {}
    themes[chat_id][theme_name] = words
    json_dump(themes)


def get_theme_name(message: types.Message, themes: dict):
    """Принимает имя новой темы от пользователя и отправляет его в другую функцию.

    Args:
        message: Объект, содержащий данные о сообщении и пользователе.
        themes: Словарь тем со словами.

    Returns:
        Выходит из функции в случае ошибки.
    """
    chat_id = message.chat.id
    new_theme = message.text.strip()
    if not new_theme:
        bot.send_message(chat_id, printer.text_create_theme('error_theme'), reply_markup=button.markup_start(), parse_mode='Markdown')
        return
    elif themes.get(str(chat_id), False):
        for old_theme in themes[str(chat_id)]:
            if new_theme.lower() == old_theme.lower():
                bot.send_message(chat_id, printer.text_create_theme('such_theme'), reply_markup=button.markup_start(),
                                 parse_mode='Markdown')
                return
    sent = bot.send_message(message.chat.id, printer.text_create_theme("words"),
                           reply_markup=button.markup_go_or_back(), parse_mode='Markdown')
    bot.clear_step_handler_by_chat_id(chat_id)
    bot.register_next_step_handler(sent, get_theme_words, new_theme, themes)


def get_theme_words(message: types.Message, new_theme: str, themes: dict):
    """Получает слова для новой темы, сохраняет тему и подтверждает пользователю.

    Args:
        message: Объект, содержащий данные о сообщении и пользователе.
        new_theme: Тема, которую ввёл пользователь.
        themes: Словарь тем со словами.

    Returns:
        Выходит из функции в случае ошибки.
    """

    words = tuple(word.strip() for word in message.text.split(',') if word.strip())

    if not words:
        bot.send_message(message.chat.id, printer.text_create_theme('error_words'), parse_mode='Markdown')
        return
    chat_id = message.chat.id
    create_theme(themes, new_theme, words, str(chat_id))
    bot.send_message(chat_id, printer.text_create_theme("successful"), parse_mode='Markdown')
    bot.send_message(chat_id, printer.text_welcome(), reply_markup=button.markup_start(),
                     parse_mode='Markdown')


def delete_theme(themes: dict, delete_theme: str, chat_id: str):
    """Удаляет тему, выбранную пользователем, кроме 4 основных тем.

    Args:
        themes: Словарь тем со словами.
        delete_theme: Тема, которую нужно удалить
        chat_id: ID чата пользователя.
    """
    themes[chat_id].pop(delete_theme)
    if themes[chat_id] == {}:
        themes.pop(chat_id)
    json_dump(themes)


def edit_message(text: str, call: types.CallbackQuery, markup: str = None) -> str:
    """Изменяет преведущее сообщение в боте и выдаёт новую информацию (текст, кнопки) по введённым аргументам.

    Args:
        text: Текст, который будет выведен пользователю.
        call: Объект запроса, содержащий информацию о callback_data, пользователе и нажатой кнопке
        markup: Объект инлайн-клавиатуры с кнопками.

    Returns:
        Возвращает, если нужно использовать `bot.register_next_step_handler()` с сообщением внутри.
    """

    return bot.edit_message_text(text, call.message.chat.id, call.message.message_id, reply_markup=markup,
                                 parse_mode='Markdown')


def json_load() -> dict:
    """Выгружает темы из файла JSON, если возникают ошибки, создаёт основные.

    Returns:
        Возвращает словарь из файла JSON или словарь, созданный из 4 основных тем.
    """
    try:
        with open('themes.json', 'r', encoding='utf-8') as file:
            return json.load(file)
    except (FileNotFoundError, json.JSONDecodeError):
        themes = {
            "Main_themes": {
                "Локации 📍": (
                    "🏫 Школа", "🧸 Детский сад", "🎓 Университет", "🏥 Больница", "🩺 Поликлиника", "💊 Аптека",
                    "🛍️ Магазин", "🛒 Супермаркет", "🍅 Рынок", "🏢 Торговый центр", "🏦 Банк", "📦 Почта",
                    "🌳 Парк", "🦁 Зоопарк", "🎪 Цирк", "🛝 Детская площадка", "🏟️ Стадион", "🏊 Бассейн",
                    "🍿 Кинотеатр", "🎭 Театр", "🏛️ Музей", "📚 Библиотека", "🖼️ Выставка", "🎸 Концерт",
                    "🍽️ Ресторан", "☕ Кафе", "🍲 Столовая", "🍕 Пиццерия", "🍔 Макдоналдс", "🥤 Кофейня",
                    "🏖️ Пляж", "🏡 База отдыха", "🌲 Лес", "⛰️ Горы", "🏞️ Река", "🛶 Озеро", "🏘️ Деревня", "🏡 Дача",
                    "✈️ Аэропорт", "🚉 Вокзал", "🚇 Метро", "🚏 Остановка", "⛽ Заправка", "🧽 Автомойка",
                    "🏨 Отель", "🛏️ Хостел", "🚪 Подъезд", "🛗 Лифт", "🔑 Квартира", "🍳 Кухня", "🛁 Ванная",
                    "🏋️‍♂️ Тренажерный зал", "💪 Фитнес-клуб", "💅 Салон красоты", "💈 Парикмахерская",
                    "👮 Полиция", "🚒 Пожарная часть", "⚖️ Суд", "⛓️ Тюрьма", "🪖 Военная база", "🏗️ Стройка",
                    "🖥️ Офис", "📦 Склад", "🏭 Завод", "🛠️ Мастерская", "🚗 Гараж", "📦 Чердак", "🕸️ Подвал",
                    "🚢 Корабль", "⛵ Лодка", "🤿 Подводная лодка", "🛩️ Самолет", "🚁 Вертолет", "🚂 Поезд",
                    "🚌 Автобус", "🚕 Такси", "🚃 Трамвай", "🚎 Троллейбус", "🚛 Грузовик", "🌌 Космос",
                    "🚀 Станция МКС", "🌕 Луна", "🪐 Марс", "🏜️ Пустыня", "🌴 Джунгли", "🪨 Пещера",
                    "⛪ Церковь", "🏰 Замок", "🏛️ Дворец", "🎨 Музей искусств", "🪐 Планетарий", "🌊 Аквапарк",
                    "⛸️ Каток", "🎳 Боулинг", "🎱 Бильярд", "🕺 Ночной клуб", "🎤 Караоке", "🎯 Тир", "🎣 Рыбалка",
                    "🏹 Охота", "🥕 Огород", "🌿 Теплица", "🐝 Пасека", "🚜 Ферма", "🐴 Конюшня",
                ),
                "Clash Royal 👑": (
                    "⚔️ Рыцарь", "🏹 Лучницы", "🪵 Гигант", "💣 Бомбер", "🏰 Принцесса(Башня)", "💀 Скелеты", "🟢 Гоблины",
                    "🐗 Всадник на кабане", "🔫 Мушкетер", "🤖 Мини П.Е.К.К.А.", "🪓 Валькирия", "🐴 Принц",
                    "⚙️ Мини-генераторы",
                    "🐉 Дракончик", "💀 Армия скелетов", "🔮 Ведьма", "🎈 Воздушный шар", "👑 Три мушкетерки", "🛸 Летучка",
                    "🪓 Варвары", "🦇 Орда миньонов", "🪓 Гоблины-копейщики", "💀 Гигантский скелет", "🤖 П.Е.К.К.А.",
                    "🦇 Миньоны", "👑 Королевский гигант", "🔥 Огненный дух", "❄️ Ледяной дух", "⚔️ Элитные варвары",
                    "🦇 Мегаминьон", "❄️ Ледяной колдун", "⛏️ Шахтер", "👑 Принцесса", "🔥 Адская Гончая", "⚡ Спарки",
                    "🪓 Дровосек", "⚡ Громовержец", "🎭 Бандитка", "🔮 Ночная ведьма", "🏹 Магический лучник",
                    "🦇 Летучие мыши",
                    "👻 Королевский призрак", "🐏 Всадник на баране (PЭМ)", "🪓 Палач", "🌾 Крестьянин", "🎯 Охотник",
                    "⚡ Электрический дракон", "💣 Стенобои", "🛡️ Целительница-воин", "🐗 Королевские кабаны", "🌿 Лоза",
                    "🛡️ Мегарыцарь", "🎣 Рыбак", "⚡ Электрический гигант", "👵 Ведьмина бабушка", "🟡 Золотой рыцарь",
                    "🛡️ Стражи",
                    "💀 Король скелетов", "👑 Королева лучниц", "⛏️ Шустрый шахтёр", "🧘 Монах", "🔮 Императрица духов",
                    "👑 Маленький принц", "⚡ Электрический дух", "✨ Дух исцеления", "🦅 Феникс", "🛡️ Темный принц",
                    "🛞 Пушка на колёсах",
                    "🏹 Стрелы", "🔥 Огненный шар", "🚀 Ракета", "⚡ Молния", "⚡ Разряд", "🪞 Зеркало", "⚡ Ярость",
                    "🌋 Руническая гигантша",
                    "❄️ Заморозка", "🧪 Яд", "🪵 Бревно", "🌪️ Торнадо", "👥 Клон", "🪵 Землетрясение", "❄️ Снежок",
                    "🪓 Берсеркша",
                    "📦 Королевская почта", "🧪 Гоблинская бочка", "💣 Бочка со скелетами", "🪵 Варварская бочка",
                    "🟢 Гигантский гоблин",
                    "🧪 Гоблинское проклятие", "🌌 Бездна", "🏰 Канонир (башня)", "🏰 Графиня (башня)", "🏰 Повар (башня)",
                    "💣 Пушка", "⚡ Тесла", "💣 Мортира", "💣 Башня-бомбежка", "🔥 Адская башня", "🏹 Арбалет",
                    "🏹 Огненная лучница",
                    "🧪 Сборщик эликсира", "🪦 Надгробие", "🛖 Хижина гоблинов", "🛖 Хижина варваров", "🔥 Печь",
                    "🐉 Костяные драконы",
                    "🪵 Клетка с гоблином", "🔩 Гоблинский бур", "❄️ Ледяной голем", "🪨 Голем", "🟢 Банда гоблинов",
                    "🛡️ Рекруты",
                    "🪓 Разбойники", "🧪 Эликсирный голем", "🟢 Гоблин с дротиками", "🪵 Подозрительный куст", "🪵 Таран",
                    "🔥 Колдун",
                    "🐉 Пламенный дракон", "🪦 Кладбище", "🔩 Гоблинская машина", "🎭 Главная бандитка", "🧪 Гоблинштейн",
                    "💣 Гоблин-подрывник"
                ),
                "Видеоигры🎮": (
                    "🧱 Minecraft", "🔫 Counter-strike 2 (CS 2)", "⚔️ Dota 2", "🚗 GTA 5", "🏡 Sims", "🧸 Roblox",
                    "🪂 Fortnite", "🍳 PUBG",
                    "🌳 Terraria", "🎯 Valorant", "🌀 Portal 2", "🪖 Call of Duty", "🔧 Team fortress 2", "🛖 Rust",
                    "✨ Genshin Impact",
                    "🤖 Cyberpunk 2077", "✈️ War Thunder", "🚜 World of Tanks", "🤫 Hello Neighbor", "🏃 Subway Surfers",
                    "🔥 Free Fire",
                    "🛡️ Clash of clans", "🏎️ Need for Speed", "📮 Among Us", "👑 Clash Royale", "🏃 Temple Run",
                    "🍉 Fruit Ninja",
                    "🐦 Angry Birds", "⭐ Brawl Stars", "🧩 Homescapes", "🚗 Hill climb racing", "🐱 Tom", "🟩 Geometry dash",
                    "🐦 Flappy bird",
                    "🚜 Hay Day", "🥷 Shadow fight", "🦔 Sonic", "🏃 Stumble guys", "🧱 Tetris", "👑 Chess", "⚪ Checkers",
                    "🧱 Block blast", "👵 Granny",
                ),
                "Minecraft 🧱": (
                    "🪨 Бедрок", "🧱 Булыжник", "🪨 Глубинный сланец", "🪨 Туф", "🪨 Кальцит", "🪨 Диорит", "🪨 Андезит",
                    "🪨 Гранит",
                    "🟫 Земля", "🟫 Подзол", "🍄 Мицелий", "🌱 Дерн", "💩 Грязь", "🟫 Плотная грязь", "🏺 Глина",
                    "🧱 Терракота",
                    "⏳ Песок", "🟠 Красный песок", "🪨 Гравий", "🔮 Обсидиан", "😢 Плачущий обсидиан", "🔥 Магма",
                    "🧊 Лед", "🧊 Плотный лед", "🔷 Синий лед", "❄️ Снег", "🌨️ Слой снега", "⛄ Плотный снег",
                    "🪵 Дубовое бревно", "🪵 Березовое бревно", "🪵 Еловое бревно", "🪵 Тропическое бревно",
                    "🪵 Акациевое бревно", "🪵 Темное дубовое бревно", "🪵 Мангровое бревно", "🌸 Вишневое бревно",
                    "🪵 Обтесанное бревно", "🪵 Доски", "🪜 Ступеньки", "🪵 Плита", "🪵 Забор", "🪵 Калитка", "🚪 Дверь",
                    "🪵 Люк",
                    "⚫ Угольная руда", "🪙 Железная руда", "🟤 Медная руда", "🟡 Золотая руда", "🔴 Редстоуновая руда",
                    "🔵 Лазуритовая руда", "💎 Алмазная руда", "💚 Изумрудная руда", "🖤 Позолоченный чернит",
                    "🌋 Древние обломки", "🔥 Незеритовый скрап", "🪙 Незеритовый слиток", "🟤 Медный слиток",
                    "🔮 Аметистовый кластер", "✨ Осколок аметиста", "🔊 Эхо-осколок", "🔱 Осколок призмарина",
                    "🔴 Незерак", "🟡 Камень Энда", "⏳ Песок душ", "🟫 Почва душ", "🪨 Базальт", "🖤 Чернит",
                    "🔵 Искаженный грибок", "🔴 Багровый грибок", "💡 Светокамень", "🪄 Стержень Энда",
                    "🟪 Пурпурный блок", "🥚 Яйцо дракона", "🐚 Скорлупа шалкера", "🟪 Шалкеровый ящик",
                    "⚙️ Поршень", "🟢 Липкий поршень", "👁️ Наблюдатель", "🏹 Раздатчик", "📦 Выбрасыватель",
                    "⏳ Повторитель", "📐 Компаратор", "🕹️ Рычаг", "🔘 Кнопка", "🪵 Нажимная плита", "🎯 Мишень",
                    "🎵 Музыкальный блок", "📻 Проигрыватель", "💡 Лампа", "☀️ Датчик дневного света",
                    "⚡ Громоотвод", "🛠️ Автоматический верстак", "🔊 Калиброванный скалковый сенсор",
                    "🔭 Подзорная труба", "🛡️ Щит", "🔱 Трезубец", "🏹 Арбалет", "🏹 Лук", "🔥 Огнево", "🪢 Поводок",
                    "🏷️ Бирка", "🏇 Седло", "🐴 Конская броня", "🪖 Незеритовый шлем", "👕 Незеритовый нагрудник",
                    "👖 Незеритовые поножи", "🥾 Незеритовые ботинки", "🦅 Элитра", "🗿 Тотем бессмертия",
                    "🥕 Золотая морковь", "🍎 Зачарованное золотое яблоко", "🍲 Тушеное кроличье мясо",
                    "🍉 Ломтик арбуза", "🍓 Ягода светящаяся", "🍇 Хорус", "🧪 Пузырек опыта", "👁️ Глаз Эндера",
                    "💧 Слеза Гаста", "🌋 Сгусток магмы", "🐲 Дыхание дракона", "🧪 Зелье невидимости"
                ),
            }
        }

        json_dump(themes)
        return themes


def json_dump(themes: dict):
    """Сохраняет обновлённый словарь тем в файл JSON.

    Args:
        themes: Словарь тем со словами.
    """
    with open('themes.json', 'w', encoding='utf-8') as file:
        json.dump(themes, file, indent=4, ensure_ascii=False)