# Нужные переменные:
TEXT_WELCOME = f"""🕵️‍♂️ *ВАС ВСТРЕЧАЕТ ИГРА «ШПИОН»!* 🕵️‍♂️
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🎉 Рады видеть тебя и твою компанию! Подготовка к матчу займет всего минуту.

📜 Перед игрой, рекомендую ознакомиться с правилами:
*"ℹ️ О Боте"*  ➡️  "📜 *Правила игры*"

🚀 *Благодарю за внимание и желаю жаркой партии!*"""

TEXT_NUM_PLAYERS = f"""👥 *НАСТРОЙКА КОМАНДЫ* 👥
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🔢 *Выберите количество игроков*, которые будут передавать телефон по кругу:

👇 _Тапните по нужной цифре на кнопках ниже:_"""

TEXT_CHOICE_THEME = f"""📂 *ВЫБОР КАТЕГОРИИ* 📂
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🎯 Выберите тему со словами для текущего раунда.

💡 _От темы зависит, какие слова достанутся мирным жителям!_"""

TEXT_FINISH_ROLES = f"""🏁 *ВСЕ РОЛИ РАСПРЕДЕЛЕНЫ!* 🏁
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🔥 Все игроки успешно узнали свои роли и секретные слова.

⏱ Включайте таймер на телефоне и начинайте бурное обсуждение! Удачи мирным и шпионам! 😎

🔄 _Чтобы перейти в главное меню, нажмите кнопку ниже:_ """

TEXT_ABOUT_BOT = f"""🤖 *О НАШЕМ ПРОЕКТЕ* 🤖
━━━━━━━━━━━━━━━━━━━━━━━━━
✨ Этот бот создан специально для весёлых вечеров в кругу друзей!
⚙️ Проект постоянно растёт, обновляется и наполняется новыми фичами.
🚀 Каждая строчка кода написана с любовью ради вашего комфорта в игре.
👇 _Все полезные ссылки и контакты уже ждут вас ниже:_ """

TEXT_CONNECT_AUTHOR = f"""🤝 *ОБРАТНАЯ СВЯЗЬ С АВТОРОМ* 🤝
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
💬 Проект создаётся и улучшается благодаря вашей активности!

🫩 Я читаю каждое сообщение и открыт для любых идей.

👇 _Выберайте нужное действие на кнопках ниже:_"""

TEXT_SHARE_FRIEND = f"""📢 *ПОДЕЛИТЬСЯ ИГРОЙ С ДРУЗЬЯМИ* 📢
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🚀 Лучшая поддержка для меня — это когда в моего «Шпиона» играют новые весёлые компании!

📋 **Ссылка на бота (нажмите, чтобы скопировать):**
`t.me/@spy_game_top_bot`

✨ _Просто скопируйте ссылку выше и отправьте её в свой чат с друзьями или в беседу, где вы обычно собираетесь на тусовки!_

❤️ _Спасибо за поддержку!_ ❤️"""

TEXT_THEMES = f"""🗂️ *УПРАВЛЕНИЕ ТЕМАМИ И СЛОВАМИ* 🗂️
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
⚙️ _Здесь вы можете гибко настроить игровой контент под свою компанию и узнать что-либо о темах._

🆕 *Расширьте базу данных бота или узнайте что-то новое.*

👇 _Выбирайте нужный пункт на кнопках ниже:_"""

TEXT_MENU_CREATE = f"""🛠️ *МЕНЮ СОЗДАНИЯ ТЕМЫ* 🛠️
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
📝 Вы перешли в режим конструктора темы со словами.

✨ Здесь вы можете добавить свою кастомную категорию!"""

TEXT_CREATE_THEME = f"""📂 *ШАГ 1: НАЗВАНИЕ КАТЕГОРИИ* 📂
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
⌨️ **Введите название новой темы:**

💡 _Например: Сериалы, Автомобили, Шоппинг_"""

TEXT_CREATE_WORDS = f"""📝 *ШАГ 2: НАПОЛНЕНИЕ СЛОВАМИ* 📝
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
⌨️ **Введите список слов через запятую:**

📌 **Правильный вид:**
» `Станция \"Москва\", Пётр 1, Игорь, Кошка, Ноутбук`

⚠️ _Постарайтесь добавить хотя бы 15-20 слов, чтобы играть было интересно!_"""

TEXT_CREATE_FINISH = f"""🎉 *УСПЕШНО СОХРАНЕНО!* 🎉
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
✅ Новая тема со всеми словами успешно добавлена в игру.

🎮 Теперь она доступна для выбора в игре!"""

TEXT_GAME_MODE = f"""🎲 *ВЫБОР РЕЖИМА ИГРЫ* 🎲
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🔮 Выберите, по каким правилам пройдет текущий поединок:

⚖️ *Классика* — честный матч с фиксированным числом шпионов.
🔥 *Хаос* — 4 безумных подрежима со случайными условиями!"""

TEXT_NUM_SHPIONS = f"""🕵️‍♂️ *ВЫБОР УРОВНЯ СЛОЖНОСТИ* 🕵️‍♂️
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
👀 *Выберите количество Шпионов*, которые будут скрытно внедрены в вашу компанию:

⚠️ _Помните: чем больше агентов, тем сложнее мирным жителям их вычислить!_"""

TEXT_MENU_DELETE = f"""🗑️ *МЕНЮ УДАЛЕНИЯ ТЕМЫ* 🗑️
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
⚠️ Вы перешли в режим редактирования базы данных.

🛑 *Будьте внимательны: удаление темы со всеми словами происходит навсегда и отменить это действие будет невозможно!*"""

TEXT_THEME_DELETE = f"""📂 *ВЫБОР КАТЕГОРИИ ДЛЯ УДАЛЕНИЯ* 📂
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🎯 *Выберите тему, которую вы хотите удалить из бота:*

👇 _Тапните по нужной кнопке с названием темы ниже:_"""

TEXT_FINISH_DELETE = f"""💥 *КАТЕГОРИЯ СТЕРТА!* 💥
━━━━━━━━━━━━━━━━━━━━━━━━━
✅ Выбранная тема и все её слова успешно удалены из базы данных бота.

🔄 Список доступных категорий в игре обновлен!"""

TEXT_INF_ABOUT_THEME = f"""🗂️ *СПИСОК ДОСТУПНЫХ КАТЕГОРИЙ* 🗂️
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
⚙️ Выбирите любую тему, чтобы открыть её панель управления.

🚀 _Внутри вы сможете отредактировать или узнать информацию о ней._

👇 _Выбирайте нужный пункт на кнопках ниже:_"""

TEXT_ALERT_RELOAD_GAME = "🔄 Игра была перезапущена ботом!"

TEXT_OLD_SESSION = f"""⚠️ *СЕССИЯ УСТАРЕЛА* ⚠️
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🔄 Бот был перезапущен, текущая сессия сбросилась.

👇 _Выбирайте нужный пункт на кнопках ниже:_"""

TEXT_COMING_SOON = f"""⏳ *ФУНКЦИЯ В РАЗРАБОТКЕ* ⏳
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🚀 Разработчик уже вовсю трудится над запуском этого крутого инструмента!

💡 У вас есть классная идея, как сделать этот функционал ещё лучше? Вы можете предложить её напрямую!

📍 **Для этого перейдите по путю:**
ℹ️ О Боте ➡️ 👤 Связь с автором ➡️ 💡 Предложить идею

✨ _Следите за обновлениями, пока можете вернуться назад_ 👇"""

TEXT_ALERT_NO_THEME = "⚠️ Внимание! У вас нет доступных тем!"

TEXT_GAME_NO_THEME = f"""❌ *ОШИБКА ЗАПУСКА* ❌
━━━━━━━━━━━━━━━━━━━━━━━━━
🛠 *Перед началом игры:*

📂 Пожалуйста, добавьте хотя бы одну тему со словами через меню управления ниже 👇"""

TEXT_DELETE_NO_THEME = f"""🗑️ *МЕНЮ УДАЛЕНИЯ ТЕМЫ* 🗑️
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
❌ *Удаление невозможно!*

📂 В базе данных бота сейчас **нет ни одной темы со словами**.

👇 _Вы можете вернуться на главный экран игры:_"""

TEXT_ERROR_CREATE_THEME = f"""❌ *ОШИБКА ВВОДА* ❌
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
⚠️ **Тема не распознана!** Название не должно быть пустым или содержать только спецсимволы.

🔄 Попробуйте ещё раз, перейдя по пути: 📂 Темы ➡️ ➕ Создать тему"""

TEXT_ERROR_CREATE_WORDS = f"""⚠️ *ОШИБКА ФОРМАТА* ⚠️
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
❌ **Слова не распознаны!** Проверьте, что вы разделили их запятыми и не отправили пустую строку.

🔄 Попробуйте ещё раз, перейдя по пути: 📂 Темы ➡️ ➕ Создать тему"""

TEXT_ERROR_SUCH_THEME = f"""❌ *ОШИБКА ВВОДА* ❌
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
⚠️ **Тема с похожим названием уже существует!** Названия тем не должны быть похожими!

🔄 Попробуйте ещё раз, перейдя по пути: 📂 Темы ➡️ ➕ Создать тему"""

TEXT_START_GAME = f"""🎭 *ОБЩИЙ СБОР И ГОТОВНОСТЬ* 🎭
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
📦 Роли и секретные слова успешно распределены в памяти.

📱 Первым телефон берет игрок: *Игрок 1*

👇 *Игрок 1*, когда будешь готов — жми на кнопку ниже, чтобы узнать, кто ты! 👀"""

TEXT_NEXT_PLAYER = f"""🔒 *РОЛЬ УСПЕШНО СКРЫТА!* 🔒
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
📱 Передайте телефон следующему игроку!

⚠️ _Убедись, что никто не подглядывает!_

👇 Когда телефон будет в руках у нужного человека, пусть он жмет кнопку:"""

# Нужные функции:
def text_current_game(lst_settings: list) -> str:
    """Возвращает текст, который сообщает все параметры игры.

    Args:
        lst_settings: Словарь с текущими данными игры.
    """
    text = (
        f"""⚙️ *ПОДТВЕРЖДЕНИЕ НАСТРОЕК* ⚙️
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
👥 Всего игроков: *{lst_settings[0]}*
🌾 Мирных жителей: {lst_settings[1]}
🕵️‍♂️ Шпионов в игре: {lst_settings[2]}
📂 Тема раунда: *{lst_settings[3]}*
🏆 Выбранный режим: *{lst_settings[4]}*
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🤔 _Вы точно хотите начать игру с этими настройками?_"""
    )
    return text


def text_chek_role(player_index: str, player_role_text: str) -> str:
    """Возвращает текст, который сообщает все параметры игры.

    Args:
        player_index: Номер игрока (Игрок 1, 2, 3...)
        player_role_text: Роль игрока под определённым индексом.
    """
    text = (
        f"""👁 *ПРОСМОТР РОЛИ* 👁
━━━━━━━━━━━━━━━━━━━━━━━━━━━━
👤 Игрок: *{player_index}*

{player_role_text}
━━━━━━━━━━━━━━━━━━━━━━━━━━━━
🤫 _Никому не показывай экран!_
👇 Как прочитаешь — жми кнопку ниже:"""
    )
    return text


def text_roles(role: str, user_theme: str, secret_word: str = "") -> str:
    """Возвращает текст, отталкиваясь от аргументов, о том, какая у вас роль, тема и секретное слово.

    Args:
        role: Игровая роль.
        user_theme: Игровая тема.
        secret_word: Секретное слово.
    """
    if role == "live":
        text = (
            f"""Вы Мирный житель! 🧑‍🌾
Тема игры: {user_theme}

Секретное слово: {secret_word}"""
        )
    else:
        text = (
            f"""Вы Шпион! 🕵️‍♂️
Тема игры: {user_theme}

Постарайтесь узнать секретное слово у мирных!"""
        )
    return text


def text_settings_theme(theme_name: str, num_words: int) -> str:
    text = (
        f"""📂 *КАТЕГОРИЯ:* {theme_name} 
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
😶 Кол-во слов: {num_words}.

🚀 Вы можете внести изменения в этой теме. 

👇 _Выбирайте нужный пункт на кнопках ниже:_"""
    )
    return text


def text_view_words(lst_words: list, theme_name: str, status):
    if status == "message":
        text = (
            f"""📂 *КАТЕГОРИЯ:* {theme_name} 📂
━━━━━━━━━━━━━━━━━━━━━━━━━
📝 *Все слова в этой теме:*
{lst_words}
✨ _Вы можете скачать этот список или вернуться назад_ 👇"""

        )
    else:
        text = (
            f"""📂 *КАТЕГОРИЯ:* {theme_name} 📂
━━━━━━━━━━━━━━━━━━━━━━━━━
{lst_words}
    ...
    
⚠️ *ВНИМАНИЕ: СЛОВ СЛИШКОМ МНОГО!* ⚠️
            
📥 Чтобы увидеть весь список слов, нажмите кнопку ниже:
        👉 «*⬇️ Скачать файл со словами*»"""
        )
    return text
